# 6.1 Reading and Writing Data in Text Format

In [35]:
import numpy as np
import pandas as pd

## Basics

In [36]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [37]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [38]:
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [39]:
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv', 
            header=1) 
            # header argument 用于指定哪一行作为 column name，且作为数据表的第一行，header 以上的行将被丢弃

   5   6   7   8 world
0  9  10  11  12   foo

In [40]:
# 供了自定义列名，覆盖文件内容
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv', 
            names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
names=['a', 'b', 'c', 'd', 'message']
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv', 
            names=names, index_col='message')
#   index_col 用于指定哪一列作为 DataFrame 的行索引（index），而不是作为普通的数据列。

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [42]:
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex2.csv', 
            names=names, index_col=2)
# 这里的2表示使用第三列（索引从0开始）作为行索引

    a   b   d message
c
3   1   2   4   hello
7   5   6   8   world
11  9  10  12     foo

分层index实例

In [43]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [44]:
parsed = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/csv_mindex.csv',
                     index_col=['key1', 'key2']) # 使用list作为index_col参数的值
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

数据没有固定分隔符（如：,），只是用了空格的情况。

In [45]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [46]:
result = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [47]:
result1 = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex3.txt', 
                      sep='\s+')
#    - sep="\s+": 匹配任意数量的空白字符（最灵活）
result1

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [48]:
result2 = pd.read_fwf('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex3.txt', 
                      sep='\t')
result2

  Unnamed: 0         A         B         C
0        aaa -0.264438 -1.026059 -0.619500
1        bbb  0.927272  0.302904 -0.032399
2        ccc -0.264273 -0.386314 -0.217601
3        ddd -0.871858 -0.348382  1.100491

无用行跳过 => skiprows = []

In [49]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [50]:
pd.read_csv("/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 哨兵值 (Sentinel Values) => NA, NULL

缺失值： NAN，NULL

CSV 文件本质上只是纯文本。在文本中，我们无法直接存储"空"这个概念（因为空字符串 "" 也是一种值）。所以，我们需要约定一些特殊的字符串来代表"空"。这些特殊的字符串被称为哨兵值 (Sentinel Values)。

In [51]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [52]:
result = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [53]:
result.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [54]:
# na_values 参数可以输入多种类型的值来定义缺失值标识符：
# na_values = [999, -1, 'NaN']
# 
# 常见默认缺失值标识符:
#      - 'NaN', 'nan', 'NA', 'N/A'
#      - 'null', 'NULL', 'None'
#      - '' (空字符串)
#      - 'missing', 'MISSING'
#      - '#N/A', '#N/A N/A', '#NA'

In [55]:
result = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv', 
                     na_values={'c':[3, 'NULL']}) 
                     # 定义 3 和 'NULL' 为缺失值
                     # Pandas 内置了一个默认缺失值列表，
                     # 其中已经包含了 'NULL', 'NaN', 'NA', '#N/A' 等常见写法。
result

  something  a   b     c   d message
0       one  1   2   NaN   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

禁用默认 NA 值: 'NULL', 'NaN', 'NA', '#N/A' 等常见写法

In [56]:
result2 = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv', 
                    keep_default_na=False)
# keep_default_na=False: 只有你指定的才是缺失值，
# 'NULL', 'NaN', 'NA', '#N/A' 等常见写法会被当成普通字符串读取
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [57]:
result2.isna() # 禁用默认 NA 值

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [58]:
result3 = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv', 
                      keep_default_na=False, 
                      na_values=['NA'])
result3 # 仅将 'NA' 识别为缺失值

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [59]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

可以为字典中的每一列指定不同的 NA 哨兵：

In [60]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv', 
            na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Reading Text Files in Pieces

在处理非常大的文件或找出正确的参数集来正确处理大文件时，您可能只想读取文件的一小部分或迭代文件的较小块。

在查看大文件之前，我们先将 pandas 显示设置更紧凑：

In [61]:
pd.options.display.max_rows = 10

In [62]:
result = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

如果只想读取少量行（避免读取整个文件），请使用 nrows 指定：

In [63]:
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex6.csv', 
            nrows=6)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q

### 分段读取大文件迭代器

要分段读取文件，请将 chunksize 指定为行数：

chunk : 块

In [64]:
chunker = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex6.csv', 
                        chunksize=1000)
chunker

In [65]:
tot = pd.Series([], dtype='float64')
for piece in chunker:
    # 从 chunker 中逐块读取 Series
    # 因为 chunker 是TextFileReader 迭代器，所以不能直接应用 dataframe.apply() 方法
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

tot.add(piece['key'].value_counts(), fill_value=0) 语法解析

In [67]:
# 1. 初始化一个空的"记分板"
tot = pd.Series([], dtype='float64')

# 2. 依次处理每一块
for piece in chunker:
    # piece 是一个 DataFrame (例如 1000 行)
    # piece['key'] 是这一块里的 'key' 列 (Series)
    # .value_counts() 统计这一块里每个 key 出现的次数
    
    # 3. 把"这一块的统计"累加到"总记分板"上
    #    fill_value=0 确保新出现的 key 不会变成 NaN
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

# 4. 所有块处理完毕，tot 就是完整的全局统计
tot = tot.sort_values(ascending=False)

   [块1] key: A, B, A    --> value_counts: {A:2, B:1}
                         |
                         v
                    tot = {A:2, B:1}

   [块2] key: B, B, C    --> value_counts: {B:2, C:1}
                         |
                    tot.add(...)
                         |
                         v
                    tot = {A:2, B:3, C:1}

   [块3] key: A, C, C    --> value_counts: {A:1, C:2}
                         |
                    tot.add(...)
                         |
                         v
                    tot = {A:3, B:3, C:3}  <-- ✅ 最终结果

IndentationError: unindent does not match any outer indentation level (<tokenize>, line 20)

## Writing Data to Text Format

In [70]:
data = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [71]:
data.to_csv('out.csv')

In [72]:
pd.read_csv('out.csv', index_col='something')

           Unnamed: 0  a   b     c   d message
something
one                 0  1   2   3.0   4     NaN
two                 1  5   6   NaN   8   world
three               2  9  10  11.0  12     foo

sys 是 Python 标准库之一，用于访问和操作 Python 解释器的某些部分。它提供了与 Python 运行时环境交互的函数和变量。

In [73]:
import sys

data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

写入 sys.stdout，将文本结果打印到控制台而不是文件

In [74]:
data.to_csv('out2.csv', sep='|')
!cat out2.csv

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [75]:
data.to_csv(sys.stdout, na_rep='NULL')
# na_rep 参数用于指定在输出文件中表示缺失值的字符串。

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [76]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [77]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'], na_rep='NULL')

a,b,c
1,2,3.0
5,6,NULL
9,10,11.0

## 其他分隔格式

In [81]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [82]:
pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

### csv 库

In [80]:
import csv

f = open('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex7.csv')

reader = csv.reader(f)

for line in reader:
    print(line)

f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [83]:
reader # type is TextFileReader, iterator

In [84]:
with open('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

header, values = lines[0], lines[1:]

data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### 自定义 csv 格式

定义 csv.Dialect 类必须根据目标文件的实际格式来定义，以确保正确解析数据。

In [85]:
class my_dialect(csv.Dialect):
    lineterminator = '\n' # 行结束符
    delimiter = ',' # 分隔符
    quotechar = '"' # 引号字符
    quoting = csv.QUOTE_MINIMAL 
    # 引号策略: 最小化引号（只对需要引号的字段加引号）, 其他参数: QUOTE_ALL（所有字段都加引号）, QUOTE_NONNUMERIC（非数字字段加引号）, QUOTE_NONE（不加引号）

with open('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex7.csv') as f:
    reader = list(csv.reader(f, dialect=my_dialect))
reader

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [86]:
with open('out2.csv') as f:
    reader1 = list(csv.reader(f, delimiter=','))
    # 以‘,’作为分隔符识别，所以将整行视为一个字段返回
reader1

[['|something|a|b|c|d|message'],
 ['0|one|1|2|3.0|4|'],
 ['1|two|5|6||8|world'],
 ['2|three|9|10|11.0|12|foo']]

In [87]:
with open('out2.csv') as f:
    reader2 = list(csv.reader(f, delimiter='|'))
    # 正确识别内容
reader2

[['', 'something', 'a', 'b', 'c', 'd', 'message'],
 ['0', 'one', '1', '2', '3.0', '4', ''],
 ['1', 'two', '5', '6', '', '8', 'world'],
 ['2', 'three', '9', '10', '11.0', '12', 'foo']]

## JSON Data

In [93]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

基本类型包括对象（dict）、array（lists）、字符串、数字、布尔和空。对象中的所有键都必须是字符串。

In [94]:
import json # python 内置

result = json.loads(obj)
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [95]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [96]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   34
1  Katie   42

In [99]:
!cat /Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [100]:
data = pd.read_json('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/example.json')
"""pandas.read_json 会自动将 JSON 中的每一行转换为一个 Series 对象。"""
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [101]:
data.to_json(sys.stdout) # 输出到控制台

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [102]:
data.to_json() # 输出字符串，用于程序内部处理

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [103]:
data.to_json(sys.stdout, orient='records') # 指定 orient='records' 以将每一行转换为一个 JSON 对象

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

默认情况下，pandas.read_html 会搜索并尝试解析 "< table>" 标记中包含的所有表格数据。结果是 DataFrame 对象的列表：

In [106]:
tables = pd.read_html('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/fdic_failed_bank_list.html')
len(tables) # 返回有几个表格

1

In [107]:
failures = tables[0]
failures.head() # 显示前5行

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [108]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts() # datetime.year

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

### Parsing XML with lxml.objectify

In [ ]:
from lxml import objectify

path = 'pydata-book-3rd-edition/datasets/mta_perf/Performance_MNR.xml'

with open(path) as f:
    parsed = objectify.parse(f)

root = parsed.getroot() # 获取 XML 文档的根元素

In [ ]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR: # root.INDICATOR 是 lxml.objectify 的语法，返回所有 INDICATOR 元素的迭代器 XML
    el_data = {}
    for child in elt.getchildren(): # getchildren() 返回子元素列表，child 是每个子元素对象
        if child.tag in skip_fields: # child.tag：XML 元素标签名（字符串）
            continue
        el_data[child.tag] = child.pyval # child.pyval：lxml.objectify 自动转换的 Python value（会自动识别数据类型：字符串、整数、浮点数等）
    data.append(el_data)

In [ ]:
data[:2]

[{'AGENCY_NAME': 'Metro-North Railroad',
  'INDICATOR_NAME': 'On-Time Performance (West of Hudson)',
  'DESCRIPTION': 'Percent of commuter trains that arrive at their destinations within 5 minutes and 59 seconds of the scheduled time. West of Hudson services include the Pascack Valley and Port Jervis lines. Metro-North Railroad contracts with New Jersey Transit to operate service on these lines.\n',
  'PERIOD_YEAR': 2008,
  'PERIOD_MONTH': 1,
  'CATEGORY': 'Service Indicators',
  'FREQUENCY': 'M',
  'INDICATOR_UNIT': '%',
  'YTD_TARGET': 95.0,
  'YTD_ACTUAL': 96.9,
  'MONTHLY_TARGET': 95.0,
  'MONTHLY_ACTUAL': 96.9},
 {'AGENCY_NAME': 'Metro-North Railroad',
  'INDICATOR_NAME': 'On-Time Performance (West of Hudson)',
  'DESCRIPTION': 'Percent of commuter trains that arrive at their destinations within 5 minutes and 59 seconds of the scheduled time. West of Hudson services include the Pascack Valley and Port Jervis lines. Metro-North Railroad contracts with New Jersey Transit to operate service on these lines.\n',
  'PERIOD_YEAR': 2008,
  'PERIOD_MONTH': 2,
  'CATEGORY': 'Service Indicators',
  'FREQUENCY': 'M',
  'INDICATOR_UNIT': '%',
  'YTD_TARGET': 95.0,
  'YTD_ACTUAL': 96.0,
  'MONTHLY_TARGET': 95.0,
  'MONTHLY_ACTUAL': 95.0}]

In [ ]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

pandas's pandas.read_xml function turns this process into a one-line expression:

In [ ]:
perf2 = pd.read_xml(path)
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

# 6.2 Binary Data Formats

以二进制格式存储（或序列化 ）数据的一种简单方法是使用 Python 的内置 pickle 模块。pandas 对象都有一个 to_pickle 方法，以 pickle 格式将数据写入磁盘：

In [110]:
frame = pd.read_csv('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

pickle 文件通常只能在 Python 中读取

In [112]:
frame.to_pickle('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/frame_pickle')
pd.read_pickle('/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
import pyarrow
fec = pd.read_parquet('pydata-book-3rd-edition/datasets/fec/fec.parquet')
fec.head()

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250.0,20-JUN-11,None,None,None,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50.0,23-JUN-11,None,None,None,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,05-JUL-11,None,None,None,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250.0,01-AUG-11,None,None,None,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300.0,20-JUN-11,None,None,None,SA17A,736166

## Reading Microsoft Excel Files

In [ ]:
xlsx = pd.ExcelFile('pydata-book-3rd-edition/examples/ex1.xlsx')
xlsx.sheet_names

['Sheet1']

In [ ]:
xlsx.parse(sheet_name='Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
xlsx.parse(sheet_name='Sheet1', index_col=-1) # index_col=-1 表示将倒数第一列作为行索引

         Unnamed: 0  a   b   c   d
message
hello             0  1   2   3   4
world             1  5   6   7   8
foo               2  9  10  11  12

In [ ]:
frame = pd.read_excel('pydata-book-3rd-edition/examples/ex1.xlsx', sheet_name='Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
writer = pd.ExcelWriter('pydata-book-3rd-edition/examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.close()

/var/folders/1m/2jsf455s4r7dx9t8l233n55c0000gp/T/ipykernel_6314/2655320818.py:2: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, 'Sheet1')

## Using HDF5 Format